---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintDiameter
source: html/cb210085-8de9-b7c2-43f7-a8f0279d3593.htm
---
# RebarShapeConstraintDiameter Members

Create a diameter constraint.